/***********************************************************************************************************************
*                                 Copyright (c) 2013,深圳创成微电子<-All rights reserved->
*               
**----------------------------------------------------------------------------------------------------------------------
*   文件名称：   EQ10.c
*   简要描述:    十段均衡器参数调节程序 
*
**----------------------------------------------------------------------------------------------------------------------
*   当前版本：   V1.0
*   作者/修改者：王自振
*   完成日期：   2014年10月30日
**----------------------------------------------------------------------------------------------------------------------
*   取代版本：
*   原作者  ：
*   完成日期：
***********************************************************************************************************************/
#include "EQ10.h"

/***********************************************************************************************************************
*   函数名称: CEQ_G10Effect_setParameter
*   功能描述: 将指定参数的值转换为501寄存器值，并发送到501芯片
*   参数列表: index:要更改的参数索引（参见 EQ_G10ParamID）    value:该参数的最新界面值
*   硬件输出: 无
*   返回结果: 无
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
void CEQ_G10Effect_setParameter (unsigned int index, float value)
{

    Gpr_len  = 0;
    Sram_len = 0;
    
    switch(index)
    {
    case eInputGain:
        SetDspRegister(R_S, _dbl_to_dspword(cBtoG((int)value)));
        break;
    case eBand31Hz:
    case eBand62Hz:
    case eBand125Hz:
    case eBand250Hz:
    case eBand500Hz:
    case eBand1kHz:
    case eBand2kHz:
    case eBand4kHz:
    case eBand8kHz:
    case eBand16kHz:
        SetDspRegister((word)(R_GX + R_GSTEP * (index - eBand31Hz)), 
            _dbl_to_dspword(0.25 * cBtoG((int)value) - 0.25));
        break;
    default:
        break;
    }
}

/***********************************************************************************************************************
* end of file
***********************************************************************************************************************/


