/***********************************************************************************************************************
*                                 Copyright (c) 2013,深圳创成微电子<-All rights reserved->
*               
**----------------------------------------------------------------------------------------------------------------------
*   文件名称：   gain1.c
*   简要描述:    增益调节参数转换程序
*
**----------------------------------------------------------------------------------------------------------------------
*   当前版本：   V1.0
*   作者/修改者：王自振
*   完成日期：   2014年10月30日
**----------------------------------------------------------------------------------------------------------------------
*   取代版本：
*   原作者  ：
*   完成日期：
***********************************************************************************************************************/
#include "gain.h"

/***********************************************************************************************************************
*   函数名称: GainEffect_setParameter
*   功能描述: 将指定参数的值转换为501寄存器值，并发送到501芯片
*   参数列表: index:要更改的参数索引（参见 EQ_G10ParamID）    value:该参数的最新界面值
*   硬件输出: 无
*   返回结果: 无
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
void GainEffect_setParameter (unsigned int index, float value)
{
    dword dwTemp = 0x7fffffff;
    
    Gpr_len  = 0;
    Sram_len = 0; 
    
    dwTemp *= (value / 100);
    
    if(index == eGain1)
    {
        SetDspRegister(_INTEGER  + GAIN1_GPR0x100_OFFSET, (dword)(dwTemp / GAIN_UNIT));
        SetDspRegister(_FRACTION + GAIN1_GPR0x100_OFFSET, (dword)((dwTemp & (GAIN_UNIT-1)) * GAIN_RESOLUTION));
    }
    else if(index == eGain2)
    {
        SetDspRegister(_INTEGER  + GAIN2_GPR0x100_OFFSET, (dword)(dwTemp / GAIN_UNIT));
        SetDspRegister(_FRACTION + GAIN2_GPR0x100_OFFSET, (dword)((dwTemp & (GAIN_UNIT-1)) * GAIN_RESOLUTION));
    }
}

/***********************************************************************************************************************
* end of file
***********************************************************************************************************************/


