/***********************************************************************************************************************
*                                 Copyright (c) 2013,深圳创成微电子<-All rights reserved->
*               
**----------------------------------------------------------------------------------------------------------------------
*   文件名称：   plugin_common.c
*   简要描述:    插件通用子函数
*
**----------------------------------------------------------------------------------------------------------------------
*   当前版本：   V1.0
*   作者/修改者：王自振
*   完成日期：   2014年10月30日 
**----------------------------------------------------------------------------------------------------------------------
*   取代版本：
*   原作者  ：
*   完成日期：
***********************************************************************************************************************/
#include "plugin_common.h"                                                               /* 包含通用子函数             */


/***********************************************************************************************************************
* 全局变量 (缓存更改过的Gpr和Sram)
***********************************************************************************************************************/

word Gpr_len;
word Sram_len;
word Gpr_buffer[64][4];
word Sram_buffer[64][4];

/***********************************************************************************************************************
*   函数名称: dBtoG
*   功能描述: (x)dB到线性的转换
*   参数列表: x:dB值
*   硬件输出: 无
*   返回结果: 10^(x/20)
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
double dBtoG(double x) 
{
    return exp(0.1151292546498 * x);
} 

/***********************************************************************************************************************
*   函数名称: cBtoG
*   功能描述: (x)dB/10到线性的转换
*   参数列表: x:dB值
*   硬件输出: 无
*   返回结果: 10^((x)/200)
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
double cBtoG(double x) 
{ 
    return exp(0.01151292546498 * x);
}   

/***********************************************************************************************************************
*   函数名称: _dbl_to_dspword
*   功能描述: 将浮点小数转换为定点小数（DSP寄存器值）
*   参数列表: x:dB值
*   硬件输出: 无
*   返回结果: 定点小数
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
dword _dbl_to_dspword(double x)
{
    double y = (x * 2147483647.5) - 0.25;
    y += 6755399441055744.0;
    return ((dword*) &y)[0];
}

/***********************************************************************************************************************
*   函数名称: calc_gain
*   功能描述: 将采样值转换为增益
*   参数列表: len_samp：采样值  time_s:
*   硬件输出: 无
*   返回结果: 定点小数
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
double calc_gain(double len_samp, double time_s)
{
	double x;

	x = (double)-60*((double)len_samp/48000); 
	return pow(10.0,(double)(x/time_s)/25);
}

/***********************************************************************************************************************
*   函数名称: SetDspRegister
*   功能描述: 将给定值更新到指定地址的寄存器
*   参数列表: add:寄存器绝对地址 val：寄存器内容
*   硬件输出: 无
*   返回结果: 无
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
void SetDspRegister(word add, dword val)
{
    Gpr_buffer[(word)(Gpr_len/4)][0] = add;
    Gpr_buffer[(word)(Gpr_len/4)][1] = 0x0000;
    Gpr_buffer[(word)(Gpr_len/4)][2] = (word) ((val >> 16) & 0xffff);
    Gpr_buffer[(word)(Gpr_len/4)][3] = (word) (val & 0xffff);
      
//     printf("0x%04x, 0x%08x\r\n", add, val);
//     printf("0x%04x, 0x%04x, 0x%04x, 0x%04x\r\n",Gpr_buffer[Gpr_len][0],Gpr_buffer[Gpr_len][1],Gpr_buffer[Gpr_len][2],Gpr_buffer[Gpr_len][3]); 
    
    Gpr_len+=4 ;    
}
       

/***********************************************************************************************************************
*   函数名称: SetDspRegister
*   功能描述: 将给定值更新到指定地址的寄存器
*   参数列表: add:寄存器绝对地址 val：寄存器内容
*   硬件输出: 无
*   返回结果: 无
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
void SetTramAddr(word add, dword val)
{
    Gpr_buffer[(word)(Gpr_len/4)][0] = add;
    Gpr_buffer[(word)(Gpr_len/4)][1] = 0x0000;
    Gpr_buffer[(word)(Gpr_len/4)][2] = (word) ((val >> 16) & 0xffff);
    Gpr_buffer[(word)(Gpr_len/4)][3] = (word) (val & 0xffff);
      
//     printf("0x%04x, 0x%08x\r\n", add, val);
//     printf("0x%04x, 0x%04x, 0x%04x, 0x%04x\r\n",Gpr_buffer[Gpr_len][0],Gpr_buffer[Gpr_len][1],Gpr_buffer[Gpr_len][2],Gpr_buffer[Gpr_len][3]); 
    
    Gpr_len+=4 ;  
}

/***********************************************************************************************************************
*   函数名称: WriteInstruction
*   功能描述: 替换微代码中的内容
*   参数列表: 略
*   硬件输出: 无
*   返回结果: 无
*   历史记录: 作者/修改者            日期                    备注
*             王自振                 2014.10.30            原始创建版本V1.0
***********************************************************************************************************************/
void WriteInstruction(word offset,word op,word z,word w,word x,word y)
{    
    Sram_buffer[(word)(Sram_len/4)][0] = offset;
    Sram_buffer[(word)(Sram_len/4)][1] = ((z & 0x0400) << 5) | ((w & 0x0400)<<4) | ((x & 0x0400)<<3) | ((y & 0x0400)<<2) |
                               ((op & 0x0f)  << 8) | ((z & 0x03fc)>>2);
    Sram_buffer[(word)(Sram_len/4)][2] = ((z & 0x03)   <<14) | ((w & 0x03ff)<<4) | ((x & 0x03c0)>>6) ;
    Sram_buffer[(word)(Sram_len/4)][3] = ((x & 0x003f) <<10) | ((y & 0x03ff)<<0) ;   

//     printf("0x%04x, 0x%04x, 0x%04x, 0x%04x,0x%04x\r\n", op, z, w, x, y);     
//     printf("0x%04x, 0x%04x, 0x%04x, 0x%04x\r\n",Sram_buffer[Sram_len][0],Sram_buffer[Sram_len][1],Sram_buffer[Sram_len][2],Sram_buffer[Sram_len][3]);    
    Sram_len+=4 ; 
       
}


unsigned int Get_Gpr_len(void)
{
   return ((unsigned int)(Gpr_len/2));
}

unsigned int Get_ISRAM_len(void)
{
   return ((unsigned int)(Sram_len/2));
}

unsigned int Get_gpr_data(word index)
{
    unsigned int temp1,temp2,temp;
    
    temp1 =  *((unsigned int*)(&Gpr_buffer[0][0]) + index);
    temp2 =  *((unsigned int*)(&Gpr_buffer[0][0]) + index);
    temp = ((temp1<<16)&0xffff0000) | ((temp2>>16) &0x0000ffff);

    return  temp;    
}

unsigned int Get_ISRAM_data(word index)
{
    unsigned int temp1,temp2,temp;
    
    temp1 =  *((unsigned int*)(&Sram_buffer[0][0]) + index);
    temp2 =  *((unsigned int*)(&Sram_buffer[0][0]) + index);
    temp = ((temp1<<16)&0xffff0000) | ((temp2>>16) &0x0000ffff);

    return  temp;  
}



/***********************************************************************************************************************
* end of file
***********************************************************************************************************************/


